[
  {
    "path": "posts/welcome/",
    "title": "Welcome to ISSS608 Visual Analaytics Project Team 7",
    "description": "Welcome to our new blog, ISSS608 Visual Analaytics Project Team 7. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-21",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T01:39:36+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-06-21-isss608-visual-analytics-project-team-7/",
    "title": "ISSS608 Visual Analytics Project Team 7",
    "description": "Project Team.",
    "author": [
      {
        "name": "Yeo Chia Guan Andy, Stella Koh, Alex Ong chee Chong",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-06-21",
    "categories": [],
    "contents": "\r\nProject Proposal\r\nOverview\r\nGASTech, a Kronos based company provides company cars for its employees for both personal and business use. Those who are not provided with company cars are allowed to check out trucks for business use. However, those trucks are not allowed for personal use.\r\nEmployees entitled to the company cars are generally happier with the company’s car than their own due to the difference in quality. As such, GASTech does not trust the way employees are using the cars. The company installed geospatial tracking software in the company car to track the car’s movement.\r\nThe vehicle tracking data has been made available to law enforcement to assist in their investigation. However, data is only available two weeks prior to their disappearance.\r\nTo promote local businesses, Kronos based companies provide Kronos Kares benefit card to GASTech employees by giving them discounts and loyalty rewards in exchange for credit card purchases and preferences. These data are given to the law enforcement for their investigation.\r\nObjective\r\nThe objective is to identify the purchases made by the GASTech employees and examine any suspicious behavior in their purchase patterns.\r\nMotivation\r\nTo draw relations between the GASTech employee and their purchases and to identify suspicious patterns of behavior.\r\nMain Features of Application\r\nThe application should be interactive to allow users to filter out the data to draw better insights like focusing on an individual vehicle ID for its location patterns.\r\nProblems and Issues to be Addressed\r\nVarying treatments for missing and outlier data may result in different conclusions. For example, there are gps information for vehicle ID 101-107 which are not tagged to any EmpID.\r\nDifferent resolutions- Loyalty card data is shown on a monthly basis, while credit card data is shown daily with timestamp included.\r\nData Source\r\nFor this project, we will be using data provided in the Vast Challenge 2021, mini challenge 2.\r\nApproach\r\nUsing the map provided, map out the credit card and loyalty spend using a dot plot overlayed on the map to assess which are the popular locations and during which times.\r\nIdentify the geographical location of the vehicle by car ID with respect to time using lat and long data.\r\nUsing the composite keys 1) Time, 2) Location and 3) Price to match the credit card number to the loyalty card number. The pair should be consistent.\r\nDetermine the location of the shops in the loyalty and cc datasets using Lat and Long data from the GPS data by referencing to time. The vehicle ID that is not tagged to personnel (ID >100) are assumed to be trucks, driven by truck drivers. To determine if the truck has been used for personal use, we examine if the truck was observed to appear at the shops.\r\nDevelop an interactive map to detect the location of the cars and trucks to examine whether there is any presence of suspicious activity (E.g., Several cars gathering at the same point at the same date and time etc.).\r\nSchedule\r\nTasks Name\r\nStart Date (DD/MM/YY)\r\nEnd Date (DD/MM/YY)\r\nAssigned To\r\n% Completion\r\nFormulate Project details\r\n05/06/21\r\n08/06/21\r\nAll\r\n99.9%\r\nProject consultation with Prof\r\n11/06/21\r\n11/06/21\r\nAll\r\n0%\r\nRefine project scope and ideas\r\n12/06/21\r\n20/06/21\r\nAll\r\n0%\r\nComplete project proposal and publish on Netlify page\r\n12/06/21\r\n20/06/21\r\nAll\r\n0%\r\nData Preparation\r\n21/06/21\r\n30/06/21\r\nAll\r\n0%\r\nDraft Application Features\r\n18/07/21\r\n23/07/21\r\nAll\r\n0%\r\nCreation of application on R Shiny\r\n24/07/21\r\n31/07/21\r\nAll\r\n0%\r\nDraft Poster Design\r\n25/07/21\r\n31/07/21\r\nAll\r\n0%\r\nApplication refinement\r\n01/08/2021\r\n14/08/21\r\nAll\r\n0%\r\nDraft final report, including user guide\r\n01/08/2021\r\n14/08/21\r\nAll\r\n0%\r\nFinalise artifact\r\n01/08/2021\r\n14/08/21\r\nAll\r\n0%\r\nUpdate Netlify\r\n09/08/2021\r\n14/08/21\r\nAll\r\n0%\r\nSubmission of final application, user guide, project poster, research paper and artifacts\r\n15/08/21\r\n15/08/21\r\nAll\r\n0%\r\nPackages\r\nShinydashboard Shiny MASS Rstudioapi Tidyverse Leaflet Leaflet.extras Dplyr Sf ggplot2\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T02:21:53+08:00",
    "input_file": "isss608-visual-analytics-project-team-7.knit.md"
  }
]
